package Basic;

// Java 자료형 : 원시형(PrimitiveType), 참조형(ReferenceType)
// 원시형 : 값을 표현 (int, long ...)
// 참조형 : 특정 대상을 표현하기 위한 자료형 (배열(Array), 클래스, 인터페이스, 나열형(Enum))

// 기본형 변수 : 원시형(기본형)으로 생성된 변수 -> 값을 저장하기위한 변수
// 참조형 변수 : 참조형으로 생성된 변수 -> 메모리 주소 저장(String)
// 힙영역에 생성된 배열 또는 객체의 메모리 주소를 저장하여 접은하기 위해 사용
// 참조변수는 비교연산자를 사용할 경우 메모리 주소를 비교하게 된다. 
// 참조변수의 배열 또는 객체를 저장하지 않을 경우 초기값으로 null을 저장
// 메소드 영역, 힙영역, 스택영역
// 1. 메소드 영역 : 클래스파일의 클래스 , 인터페이스, 나열(Enum)을 읽어 저장하는 영역
// 2. 힙영역 : 배열 또는 객체를 저장하기 위한 영역 -> new 연산자이용 
// 2. 힙영역 :  메모리에 이름설정불가 - > 참조변수에 메모리 주소 (hash code)를 저장하여 접근 -> FIFO
// 3. 스택영역 : 지역변수(기본 or 참조 변수)를 저장하기 위한 영역 -> FILO

// * 메소드영역과 스택영역은 메모리 이름이 있지만 힙 영역은 이름이없어 메모리 주소 사용



public class _18_ArrayApp0404 {
	public static void main(String[] args) {
		
	}

}
